Revit 2027 API
Viewport.Rotation Property
 The rotation of the viewport on the sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewportRotation Rotation { get; set; }
Public Property Rotation As ViewportRotation
	Get
	Set
public:
property ViewportRotation Rotation {
	ViewportRotation get ();
	void set (ViewportRotation value);
}
member Rotation : ViewportRotation with get, set
Property Value
ViewportRotation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace